# -*- mode: org; -*-
#+title: guix channel for riscv

[[https://ci.z572.online/jobset/master/badge.svg?type=0]]

This is a guix channel for some riscv support package.

use https://ci.z572.online for substitute.

More development boards will be supported in the future.

We will upstream to guix what can be upstreamed to guix.

*NOTE:* This channel may have binary blobs etc.

* how to use
add this channel
add it to =~/.config/guix/channels.scm=:

#+begin_src scheme
  (cons* (channel
          (name 'guix-riscv)
          (url "https://github.com/z572/guix-riscv-channel.git")
          (branch "main"))
         %default-channels)
#+end_src

Then run =guix pull=.

** megrez
use rockos kernel

maybe support hifive-premier-p550/pine64-starpro64, but I don't have the hardware :(.

*** build
#+begin_src shell
guix system image -s riscv64-linux --expression='(@ (riscv system images megrez) megrez-barebones-raw-image)'
#+end_src
#+RESULTS:
=/gnu/store/...-megrez-barebones-raw-image=

Then you can flash the storage device and install it on megrez.

*** how to use amdgpu

add [[https://gitlab.com/nonguix/nonguix][nonguix]] channel.
#+begin_src scheme
  (use-modules (nongnu packages linux))
  ...
  (operating-system
    (inherit megrez-barebones-os)
    (kernel-arguments
     (append (list "earlycon" "clk_ignore_unused")
             (list "initcall_blacklist=es_drm_init"
                   "pcie_port_pm=off"
                   "pcie_aspm.policy=performance"
                   "module_blacklist=pvrsrvkm")))
    (firmware (cons* linux-firmware %base-firmware))
    ...)

#+end_src

see [[https://rockos-riscv.github.io/rockos-docs/en/docs/faq/#no-video-output-on-dgpu]]

** visionfive2/Milk-V Mars

*** build

#+begin_src shell
  guix system image -s riscv64-linux --expression='(@ (gnu system images visionfive2) visionfive2-barebones-raw-image)'
#+end_src
or see https://ci.guix.gnu.org/search/latest?query=spec:images+status:success+system:x86_64-linux+visionfive2-barebones-raw-image
(this is a cross-compilation image).


* separate guix package manager

https://ci.z572.online/search/latest/archive?query=spec:guix-binary+status:success+system:riscv64-linux+guix-binary.tar.xz

* substitutes
see [[https://guix.gnu.org/manual/devel/zh-cn/html_node/Getting-Substitutes-from-Other-Servers.html]]

#+begin_src scheme
  (public-key 
   (ecc 
    (curve Ed25519)
    (q #166927E5E329B2AF7E965A4AE07403B69177EB0B8556D3467A83E0BE5E3D27F9#)))
#+end_src
